
#include <stdio.h>
#include <time.h>
/*

int main()
{
	//陥託据 壕伸
	int i; //け
	int arr[5];
	//けけけけけ
	//[0][1][2][3][4]

	int arr2[3][4];
		/*
		 1 2 3 4
		1けけけけ
		2けけけけ
		3けけけけ

		[0,0][0,1][0,2][0,3]
		[1,0][1,1][1,2][1,3]
		[2,0][2,1][2,2][2,3]


int arr5[4][2];
/*
 1 2
1けけ
2けけ
3けけ
4けけ

[0,0][0,1]
[1,0][1,1]
[2,0][2,1]
[3,0][3,1]



int arr3[2][3][4];
/*
けけけ けけけ けけけ けけけ
けけけ けけけ けけけ けけけ



int arr_1[3][6] = {
	{1,2,3,4,5},
	{3,4},
	{1}
};

int arr_2[2][2][2] = {
	{
		{1, 2},
		{3, 4}
	},
	{
		{5, 6},
		{7}

	}
};
printf("%d \n", arr_1[1][1]);
printf("%d \n", arr_2[1][1][1]);

return 0;
}
*/

/*

int main()
{

	int arr[4][2] = {
		{1, 2},{1,2}
	};
	int arr1[2][2][2] = {
	{
		{1, 2},
		{3, 4}
	},
	{
		{5, 6},
		{7}

	}
	};

	for (int i = 0; i < 4; i++)
	{
		for (int j = 0; j < 2; j++) printf("%d \n", arr[i][j]);
	}

	for (int i = 0; i < 2; i++)
	{
		for (int j = 0; j < 2; j++) {

			for (int k = 0; k < 2; k++) {
				printf("%d \n", arr1[i][j][k]);
			}
		}
	}


	return 0;
}
*/